<?php
// +----------------------------------------------------------------------
// | h-admin
// +----------------------------------------------------------------------
// | redis 多租户配置
// +----------------------------------------------------------------------
// | Author: waiszer <waiszer@163.com>
// +----------------------------------------------------------------------

return [
    // 默认租户
    'default' => [
        //地址
        'host'              =>  '127.0.0.1',
        //端口
        'port'              =>  6379,
        //密码
        'password'          =>  '',
        // 使用的数据库
        'select'            =>  0,
        // 连接超时
        'timeout'           =>  2,
        // 读取超时
        'read_timeout'      =>  2,
        // 重试时间（单位：毫秒）
        'retry_interval'    =>  500,
        // 缓存前缀
        'prefix'            =>  '',
        // 缓存有效期 0表示永久缓存
        'expire'            =>  0,
        // 是否选用持久连接
        'persistent'        =>  false,
    ],
    // 其他租户...
];